import { Injectable } from '@nestjs/common';

@Injectable()
export class MistakesFixer {
  public characteristicsGenderFixer (product) {
    if (
      product.category === 'yasilky-malyky' ||
      product.category === 'shkarpetky-dlya-ditey' ||
      product.category === 'losyny-dlya-ditey' ||
      product.category === 'gamashy-dlya-ditey' ||
      product.category === 'odag-dytyachiy-shtany' ||
      product.category === 'dytyachi-brydzhi' ||
      product.category === 'odag-dytyachiy-futbolki' ||
      product.category === 'odag-dytyachiy-shorty' ||
      product.category === 'odag-dytyachiy-sportkostyumy' ||
      product.category === 'odag-dytyachiy-kurtochki' ||
      product.category === 'kolgoty-dytyachy' ||
      product.category === 'svetry-dytyachy' ||
      product.category === 'ryukzaky-dytyachy' ||
      product.category === 'kostyumy-dytyachy' ||
      product.category === 'maiky-dytyachy' ||
      product.category === 'sorochky-dytyachy' ||
      product.category === 'batniky-dytyachy' ||
      product.category === 'dzhinsy-dytyachy'
    ) {
      const gender = product.characteristics.split('Стать: ').length > 1 &&
        product.characteristics.split('Стать: ')[1].split('\n')[0]
      if (gender === 'Чоловічий') {
        const char = product.characteristics.split('\n').map(ch => {
          if (ch === 'Стать: Чоловічий') {
            return 'Стать: Для хлопчиків';
          }
          return ch
        })
        product.characteristics = char.join('\n')
      }
    }
    return product
  }

  public colorNamesFixer (color) {
    if (color === 'Сиреневый' || color === 'Бузко' || color === 'Бузк') return 'Бузковий'
    if (color === 'Персикови') return 'Персиковий'
    if (color === 'Червон' || color === 'Черво' || color === 'Терак') return 'Червоний'
    if (color === 'Сі' || color === 'Сіри' || color === 'Сі') return 'Сірий'
    if (color === 'Бежеви' || color === 'Беж') return 'Бежевий'
    if (color === 'Помаранчеви' || color === 'Пом' || color === 'Помаранче') return 'Помаранчевий'
    if (color === 'Графит') return 'Графіт'
    if (color === 'Чорн' || color === 'Чорни' || color === 'Клітинка') return 'Чорний'
    if (color === 'Блак' || color === 'Блакитн' || color === 'Блакит' || color === 'Блакитни'
      || color === 'Бл' || color === 'Бла') return 'Блакитний'
    if (color === 'Різні кольори' || color === 'Різнокольорові' || color === 'Р') return 'Різнокольоровий'
    if (color === 'Золотой') return 'Золотий'
    if (color === 'Пудро') return 'Пудровий'
    if (color === 'Пісочни') return 'Пісочний'
    if (color === 'Коричне' || color === 'Кор') return 'Коричневий'
    if (color === 'Леопа') return 'Леопардовий'
    if (color === 'Рожеви' || color === 'Роже' || color === 'Ро' || color === 'Рож') return 'Рожевий'
    if (color === 'Син') return 'Синій'
    if (color === 'Салатови') return 'Салатовий'
    if (color === 'Фіолетов' || color === 'Фіол' || color === 'Фіо') return 'Фіолетовий'
    if (color === 'Біли') return 'Білий'
    if (color === 'Мали') return 'Малиновий'
    if (color === 'Моло') return 'Молочний';
    if (color === 'Корало') return 'Кораловий';
    if (color === 'Зе') return 'Зелений';
    if (color === 'Жовт') return 'Жовтий';
    if (color === 'Мокк') return 'Мокко';
    if (color === 'Бордов') return 'Бордовий';
    if (color === 'Те' || color === 'Тем' || color === 'Т' || color === 'Темно с' ||
      color === 'Темно' || color === 'Си' || color === 'Темн') return 'Темно-синій';
    if (color === 'Світ') return 'Світло-сірий';
    return color;
  }

  public productNamesFixer (pureName) {
    const nameCutter = (name) => {
      let newName = name.split(' ');
      newName.pop();
      return newName.join(' ');
    };

    const name = nameCutter(pureName)
    if (name === 'Сукня жіноча темно-синє нашивка') return 'Сукня жіноча темно-синя'
    if (name === 'Сукня жіноча коричнова') return 'Сукня жіноча коричнева'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Шкарпетки дитячі розмір 4-5 год') return 'Шкарпетки дитячі розмір 4-5 років'
    if (name === 'Шкарпетки дитячі розмір 5-6 год') return 'Шкарпетки дитячі розмір 5-6 років'
    if (name === 'Шкарпетки дитячі розмір 3-4 год') return 'Шкарпетки дитячі розмір 3-4 років'
    if (name === 'Шкарпетки дитячі розмір 2-3 год') return 'Шкарпетки дитячі розмір 2-3 років'
    if (name === 'Шкарпетки дитячі розмір 2-3 года') return 'Шкарпетки дитячі розмір 2-3 років'
    if (name === 'Футболка дитяча бирюзова') return 'Футболка дитяча бірюзова'
    if (name === 'Футболка дитяча якорь жовта') return 'Футболка дитяча якір жовта'
    if (name === 'Вітрівка червона дівчинка') return 'Вітровка червона дівчинка'
    if (name === 'Вітрівка рожева дівчинка') return 'Вітровка рожева дівчинка'
    if (name === 'Куртка дитяча осіння помаранчева -синя  з капюшоном') return 'Куртка дитяча осіння помаранчево-синя з капюшоном'
    if (name === 'Куртка дитяча осіння помаранчева - синя  з капюшоном') return 'Куртка дитяча осіння помаранчево-синя з капюшоном'
    if (name === 'Куртка дитяча осіння зелена -синя з капюшоном') return 'Куртка дитяча осіння зелено-синя з капюшоном'
    if (name === 'Вітрівка жіноча темно-синя') return 'Вітровка жіноча темно-синя'
    if (name === 'кофта жіноча синя 42-48') return 'Кофта жіноча синя'
    if (name === 'Шорти жіночі беж') return 'Шорти жіночі бежеві'
    if (name === 'Шорти жіночі персиковий') return 'Шорти жіночі персикові'
    if (name === 'Спортивный костюм женский норма электрик') return 'Спотривний костюм жіночий електрик'
    if (name === 'Костюм жіночий двонитка моко') return 'Костюм жіночий двонитка мокко'
    if (name === 'Спортивний костюм жіночий графитовий') return 'Спортивний костюм жіночий графітовий'
    if (name === 'Спортивний костюм жіночий черний') return 'Спортивний костюм жіночий чорний'
    if (name === 'Футболка жіноча желтая з написом') return 'Футболка жіноча жовта з написом'
    if (name === 'Штани жіночі на флісі графит') return 'Штани жіночі на флісі графіт'
    if (name === 'Спідниця жіноча велюр фіолет') return 'Спідниця жіноча велюр фіолетова'
    if (name === 'Куртка демісізована чоловіча на блискавці чорна з написом') return 'Куртка демисезонна чоловіча на блискавці чорна з написом'
    if (name === 'Сорочка з довгим рукавомчоловіча чорна розмір S') return 'Сорочка з довгим рукавом чоловіча чорна розмір S'
    if (name === 'Шорти чоловічі комуфляж') return 'Шорти чоловічі камуфляж'
    if (name === 'Кросівки жіночі сині сині') return 'Кросівки жіночі сині'
    if (name === 'Кросівки жіночі різнокольорові в смужкуі текстиль') return 'Кросівки жіночі різнокольорові в смужку'
    if (name === 'Сукня жіножа тигрова розмір 42-44') return 'Сукня жіноча тигрова розмір 42-44'
    if (name === 'Сукня жіноча коричнова') return 'Сукня жіноча коричнева'
    if (name === 'Жіноча сукня пудрове') return 'Жіноча сукня пудрова'
    if (name === 'Сукня жіножа жовта розмір 42') return 'Сукня жіноча жовта розмір 42'
    if (name === 'Сукня жіноча фіолетове') return 'Сукня жіноча фіолетова'
    if (name === 'Сукня жіноча темно-синє') return 'Сукня жіноча темно-синя'
    if (name === 'Сукня жіноча коричневе') return 'Сукня жіноча коричнева'
    if (name === 'Сукня жіножа зебра розмір 42-44') return 'Сукня жіноча зебра розмір 42-44'
    if (name === 'Сукня жіножа біла розмір 42') return 'Сукня жіноча біла розмір 42'
    if (name === 'Сукня жіноча бежеве') return 'Сукня жіноча бежева'
    if (name === 'Сукня жіноча темно-зелене') return 'Сукня жіноча темно-зелена'
    if (name === 'Сукня жіноча персикове') return 'Сукня жіноча персикова'
    if (name === 'Сукня жіноча сіре') return 'Сукня жіноча сіра'
    if (name === 'Сукня жіноча блакитне') return 'Сукня жіноча блакитна'
    if (name === 'Сукня жіноча сіре') return 'Сукня жіноча сіра'
    if (name === 'Сукня жіноча синє розмір S') return 'Сукня жіноча синя розмір S'
    if (name === 'Сукня жіоча чорна') return 'Сукня жіноча чорна'
    if (name === 'Сукня жіноча рожеве') return 'Сукня жіноча рожева'
    if (name === 'Сукня жіноча чорне') return 'Сукня жіноча чорна'
    if (name === 'Сукня жіноча 2498 темно-сіре') return 'Сукня жіноча темно-сіра'
    if (name === 'Сукня жіноча бежеве') return 'Сукня жіноча бежева'
    if (name === 'Сукня жіноча чорне 44') return 'Сукня жіноча чорна'
    if (name === 'Сукня жіноча салатове') return 'Сукня жіноча салатова'
    if (name === 'Сукня жіноча 2498 світло-зелене') return 'Сукня жіноча світло-зелена'
    if (name === 'Сукня жіноча помаранчеве') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіноча помаранчеве') return 'Сукня жіноча помаранчева'
    if (name === 'Сукня жіножа рожева розмір 42') return 'Сукня жіноча рожева'
    if (name === 'Жіноча сукня блакитне') return 'Жіноча сукня блакитна'
    if (name === 'Сукня жіноча пісочне') return 'Сукня жіноча пісочна'
    if (name === 'Сукня жіоча пудрова') return 'Сукня жіноча пудрова'
    if (name === 'Сукня жіноча коралове') return 'Сукня жіноча коралова'
    if (name === 'Сукня жіноча 2784 темно-синє') return 'Сукня жіноча темно-синя'
    if (name === 'Сукня жіножа синя розмір 42-44') return 'Сукня жіноча синя'
    if (name === 'Шкарпетки махрові дитячі для хлопчика салатого кольору розмір 26-30') return 'Шкарпетки махрові дитячі для хлопчика салатового кольору розмір 26-30'
    if (name === 'Ковдра двуспальна демісезонна мокко') return 'Ковдра двохспальна демісезонна мокко'
    if (name === 'Бриджі дитячі хлопчик темно-синьго кольору') return 'Бриджі дитячі хлопчик темно-синього кольору'
    if (name === 'Бриджі дитячі хлопчик синьго кольору') return 'Бриджі дитячі хлопчик синього кольору'
    if (name === 'Спортивна кофта дитяча дівчинка на флісі черного кольору') return 'Спортивна кофта дитяча дівчинка на флісі чорного кольору'
    if (name === 'Уггі жіночі темно-синиеі з зірочками штучна замша') return 'Уггі жіночі темно-сині з зірочками штучна замша'
    if (name === 'Шапка дитяча рожнева') return 'Шапка дитяча рожева'
    if (name === 'Шапка дитяча тепла цигляного кольору на 3-4 роки') return 'Шапка дитяча тепла цегляного кольору на 3-4 роки'
    if (name === 'Лосіни жіночі на флісі джинс темні') return 'Лосини жіночі на флісі джинс темні'
    if (name === 'Лосіни жіночі на флісі джинс сині') return 'Лосини жіночі на флісі джинс сині'
    if (name === 'Лосіни жіночі фітнес сірі з рожевим') return 'Лосини жіночі фітнес сірі з рожевим'
    if (name === 'Лосини матові полубатал імітація шкіри чорні') return 'Лосини матові півбатал імітація шкіри чорні'
    if (name === 'Лосіни жіночі в рубчик на байці чорні') return 'Лосини жіночі в рубчик на байці чорні'
    if (name === 'Жноча  блузка чорна') return 'Жіноча блузка чорна'
    if (name === 'Кросівки дитячі дівчинка светло-рожеві') return 'Кросівки дитячі дівчинка світло-рожеві'
    if (name === 'Черевики дитячI дiвчинка бордовi') return 'Черевики дитячі дiвчинка бордовi'
    if (name === 'Лосіни дитячі сірі') return 'Лосини дитячі сірі'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Лосіни дитячі темно-сині') return 'Лосини дитячі темно-сині'
    if (name === 'Лосіни дитячі чорні') return 'Лосини дитячі чорні'
    if (name === 'Лосіни дитячі на флісі чорні') return 'Лосини дитячі на флісі чорні'
    if (name === 'Кардіган жіночій під альпаку бежевий') return 'Кардиган жіночий бежевий'
    if (name === 'Комбенизон шнурок жовта смужка') return 'Комбінезон шнурок жовта смужка'
    if (name === 'Комбенизон кнопки блакитна смужка') return 'Комбінезон кнопки блакитна смужка'
    if (name === 'Комбенизон кнопки чорна смужка') return 'Комбінезон кнопки чорна смужка'
    if (name === 'Комбенизон кнопки червона смужка') return 'Комбінезон кнопки червона смужка'
    if (name === 'Костюм спортивний чоловічий графит') return 'Костюм спортивний чоловічий графіт'
    if (name === 'Спортивний костюм чоловічий тринитка на флісі графитовий') return 'Спортивний костюм чоловічий тринитка на флісі графітовий'
    if (name === 'Туфлі дитячі дівчинка рожеві штучний лак на ліпучкі') return 'Туфлі дитячі дівчинка рожеві штучний лак на липучкі'
    if (name === 'Туфлі дитячі дівчинка чорні з былим штучна шкіра') return 'Туфлі дитячі дівчинка чорні з білим штучна шкіра'
    if (name === 'Туфлі підліток хлопчик темно-сині на ліпучкі') return 'Туфлі підліток хлопчик темно-сині на липучкі'
    if (name === 'Туфлі підліток хлопчик чорні на ліпучкі') return 'Туфлі підліток хлопчик чорні на липучкі'
    if (name === 'Чоботи дитячі дівчинка сині на ліпучці') return 'Чоботи дитячі дівчинка сині на липучці'
    if (name === 'Чоботи дитячі дівчинка зимові червоні на ліпучці') return 'Чоботи дитячі дівчинка зимові червоні на липучці'
    if (name === 'Уггі дитячі дівчинка темно-сині на ліпучці') return 'Уггі дитячі дівчинка темно-сині на липучці'
    if (name === 'Дутики дитячі дівчинка зимові чорного кольору на ліпучці') return 'Дутики дитячі дівчинка зимові чорного кольору на липучці'
    if (name === 'Чоботи дитячі дівчинка зимові рожеві на ліпучці') return 'Чоботи дитячі дівчинка зимові рожеві на липучці'
    if (name === 'Капціі дитячі червоні') return 'Капці дитячі червоні'
    if (name === 'Капці дитячі з люрексомі золотисті') return 'Капці дитячі з люрексом золотисті'
    if (name === 'Крокси підліток пена блакитні розмір 34/35') return 'Крокси підліток піна блакитні розмір 34/35'
    if (name === 'Крокси підліток пена чорні') return 'Крокси підліток піна чорні'
    if (name === 'Крокси дитячі помаранчові') return 'Крокси дитячі помаранчеві'
    if (name === 'Босоніжки жіночі серебряні') return 'Босоніжки жіночі срібні'
    if (name === 'Шльопанці жіночі серебристі') return 'Шльопанці жіночі сріблясті'
    if (name === 'Рюкзак хутряний дитячий із сердцем сірий') return 'Рюкзак хутряний дитячий із серцем сірий'
    if (name === 'Рюкзак хутряний дитячий із сердцем коричневий') return 'Рюкзак хутряний дитячий із серцем коричневий'
    if (name === 'Рюкзак хутряний дитячий із сердцем білий') return 'Рюкзак хутряний дитячий із серцем білий'
    if (name === 'Рюкзак хутряний дитячий із сердцем рожевий') return 'Рюкзак хутряний дитячий із серцем рожевий'
    if (name === 'Рюкзак хутряний дитячий із сердцем пудровий') return 'Рюкзак хутряний дитячий із серцем пудровий'
    if (name === 'Костюм женский с юбкой жовтий с/м') return 'Костюм жіночий з юбкою жовтий'
    if (name === 'Костюм спортивний бузковий  pS-M') return 'Костюм спортивний бузковий'
    if (name === 'Парпасолька автоматична') return 'Парасолька автоматична'
    if (name === 'Вiтрiвка чоловiча темно-синя') return 'Вiтровка чоловiча темно-синя'
    if (name === 'Ветровка чоловіча чорна') return 'Вітровка чоловіча чорна'
    if (name === 'Ветровка чоловіча темно-синя') return 'Вітровка чоловіча темно-синя'
    if (name === 'Ветровка чоловіча синя') return 'Вітровка чоловіча синя'
    if (name === 'Ветровка чоловіча з кишенями хакі') return 'Вітровка чоловіча з кишенями хакі'
    if (name === 'Ветровка чоловіча з кишенями чорна') return 'Вітровка чоловіча з кишенями чорна'
    if (name === 'Костюм дитячий дівчинка сірий з пудрой') return 'Костюм дитячий дівчинка сірий з пудрою'
    if (name === 'Сорочка дитяча хлопчиксиня') return 'Сорочка дитяча хлопчик синя'
    if (name === 'Кофта детская девочка голубого цвета') return 'Кофта дитяча дівчинка синього кольору'
    if (name === 'Рушник кухонний махровий сіроого кольору') return 'Рушник кухонний махровий сірого кольору'
    if (name === 'Рушник банний махровий помаранчового кольору') return 'Рушник банний махровий помаранчевого кольору'
    if (name === 'Косметичка жіноча хамелион') return 'Косметичка жіноча хамеліон'
    if (name === 'бананка блакитна') return 'Бананка блакитна'
    if (name === 'Бананка жіноча серебристого кольору однотонна') return 'Бананка жіноча срібного кольору однотонна'
    if (name === 'Шльопанці дитячі пена темно-сині') return 'Шльопанці дитячі піна темно-сині'
    if (name === 'Шльопанці дитячі пена сині') return 'Шльопанці дитячі піна сині'
    if (name === 'Шльопанці дитячі пена фіолетові') return 'Шльопанці дитячі піна фіолетові'
    if (name === 'Шльопанці дитячі пена бірюзові') return 'Шльопанці дитячі піна бірюзові'
    if (name === 'Шльопанці дитячі пена рожеві') return 'Шльопанці дитячі піна рожеві'
    if (name === 'Шльопанці дитячі пена сині') return 'Шльопанці дитячі піна сині'
    if (name === 'Шльопанці дитячі пена сині розмір 30') return 'Шльопанці дитячі піна сині'
    if (name === 'Шльопанці дитячі пена блакитні') return 'Шльопанці дитячі піна блакитні'
    if (name === 'Шльопки дитячі дівчинка блакитні з рожевым') return 'Шльопки дитячі дівчинка блакитні з рожевим'
    if (name === 'Рюкзар спортивний блакитний') return 'Рюкзак спортивний блакитний'
    if (name === 'Рюкзар спортивний червоний') return 'Рюкзак спортивний червоний'
    if (name === 'Рюкзар спортивний малиновий') return 'Рюкзак спортивний малиновий'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    if (name === 'Сукня жіоча мокко') return 'Сукня жіноча мокко'
    return name
  }
}
